{
  "mcpServers": {
    "serena": {
      "description": "Semantic coding tools for intelligent codebase exploration and manipulation. Serena provides essential semantic code retrieval and editing tools that are akin to an IDE's capabilities, extracting code entities at the symbol level and exploiting relational structure. When combined with an existing coding agent, these tools greatly enhance (token) efficiency. You can think of Serena as providing IDE-like tools to your LLM/coding agent. With it, the agent no longer needs to read entire files, perform grep-like searches or basic string replacements to find the right parts of the code and to edit code. Instead, it can use code-centric tools like `find_symbol`, `find_referencing_symbols` and `insert_after_symbol`. You should usually use this MCP server when you search for codebase information.",
      "type": "stdio",
      "command": "uvx",
      "args": [
        "--from",
        "git+https://github.com/oraios/serena",
        "serena",
        "start-mcp-server",
        "--context",
        "ide-assistant",
        "--enable-web-dashboard",
        "false",
        "--project",
        "."
      ],
      "env": {}
    },
    "context7": {
      "description": "Up-to-date documentation and code examples for libraries. You should usually use this MCP server when you search for library documentation.",
      "type": "stdio",
      "command": "pnpx",
      "args": [
        "@upstash/context7-mcp"
      ],
      "env": {}
    },
    "fetch": {
      "description": "This server enables LLMs to retrieve and process content from web pages, converting HTML to markdown for easier consumption. You should usually use this MCP server when you fetch web content.",
      "type": "stdio",
      "command": "uvx",
      "args": [
        "mcp-server-fetch"
      ],
      "env": {}
    },
    "rulesync-mcp": {
      "description": "This server handles rules, commands, MCP, ignore files, and subagents for any AI agents. You should usually use this MCP server when you need to handle rules, commands, MCP, ignore files, and subagents for any AI agents.",
      "type": "stdio",
      "command": "pnpm",
      "args": [
        "dev",
        "mcp"
      ],
      "env": {}
    }
  }
}
